LOad and Inspect Dataset

In [1]:
import pandas as pd

# Load dataset
df = pd.read_csv('../data/producer-prices_npl.csv')

df.head()

,Iso3,StartDate,EndDate,Area Code,Area Code (M49),Area,Item Code,Item Code (CPC),Item,Element Code,Element,Year Code,Year,Months Code,Months,Unit,Value,Flag
0,#country+code,#date+start,#date+end,NaN,NaN,#country+name,#indicator+code,NaN,#indicator+name,NaN,NaN,NaN,#date+year,NaN,NaN,#indicator+type,#indicator+value+num,NaN
1,NPL,1991-01-01,1991-12-31,149.0,'524,Nepal,221,'01371,"Almonds, in shell",5530.0,Producer Price (LCU/tonne),1991.0,1991,7021.0,Annual value,LCU,80291.600000,I
2,NPL,1992-01-01,1992-12-31,149.0,'524,Nepal,221,'01371,"Almonds, in shell",5530.0,Producer Price (LCU/tonne),1992.0,1992,7021.0,Annual value,LCU,67149.300000,I
3,NPL,1993-01-01,1993-12-31,149.0,'524,Nepal,221,'01371,"Almonds, in shell",5530.0,Producer Price (LCU/tonne),1993.0,1993,7021.0,Annual value,LCU,67990.600000,I
4,NPL,1994-01-01,1994-12-31,149.0,'524,Nepal,221,'01371,"Almonds, in shell",5530.0,Producer Price (LCU/tonne),1994.0,1994,7021.0,Annual value,LCU,71168.600000,I